app/views/careers/_career_details_fields.html.erb

SELECT `career_details`.* FROM `career_details` WHERE `career_details`.`career_id` = 2
---
        <script>
          $(document).ready(function() {
            var link = $('#new_career_detail_link');
            link.click(function() {
              var index = link.closest('table').find('tr').length;

              $.get('<%= url_for :action => 'new_career_detail' %>', {index: index, format: 'html'},
                function(data) {
                  link.closest('tr').before(data);
                });
              });
          });