app/views/careers/_form.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
      <%= User.human_attribute_name :first_name %><br />
      <%= @career.user.first_name %>

SELECT `career_details`.* FROM `career_details` WHERE `career_details`.`career_id` = 1 AND `career_details`.`id` IN (1, 0)
---
          <script>
            $(document).ready(function() {
              var link = $('#new_career_detail_link');
              link.click(function() {
                var index = link.closest('table').find('tr').length;

                $.get('<%= url_for :action => 'new_career_detail' %>', {index: index, format: 'html'},
                  function(data) {
                    link.closest('tr').before(data);
                  });
                });
            });