app/views/careers/_show_career_details.html.erb

SELECT `career_details`.* FROM `career_details` WHERE `career_details`.`career_id` = 1
---

    <% @career.career_details.each do |cd| %>