app/controllers/careers_controller.rb

  def show
    @career = Career.find(params[:id])
---
SELECT `careers`.* FROM `careers` WHERE `careers`.`id` = 1 LIMIT 1

  def create
    @career = Career.new(career_params)

    begin
      @career.transaction do
        @career.save!
---
INSERT INTO `careers` (`created_at`, `deleted`, `introduction`, `updated_at`, `user_id`) VALUES ('2013-06-30 05:44:59', 0, 'a', '2013-06-30 05:44:59', 1)

  def edit
    @career = Career.find(params[:id])
---
SELECT `careers`.* FROM `careers` WHERE `careers`.`id` = 1 LIMIT 1

  def update
    @career = Career.find(params[:id])
    @career.attributes = params[:career_params]

    begin
      @career.transaction do
        @career.save!
---
SELECT `careers`.* FROM `careers` WHERE `careers`.`id` = 1 LIMIT 1
UPDATE `careers` SET `introduction` = '初めまして。\r\n○○をずっとやってきました。', `updated_at` = '2013-06-30 07:38:41' WHERE `careers`.`id` = 1

  def destroy
    @career = Career.find(params[:id])

    @career.transaction do
      @career.destroy_logically!
---
SELECT `careers`.* FROM `careers` WHERE `careers`.`id` = 1 LIMIT 1
DELETE FROM `careers` WHERE `careers`.`id` = 1